const historyData = [
{
 title:"พระบาทสมเด็จพระบรมชนกาธิเบศร มหาภูมิพลอดุลยเดชมหาราช บรมนาถบพิตร (รัชกาลที่ 9)",
 detail:"เสด็จพระราชสมภพ 5 ธ.ค. 2470 ณ สหรัฐอเมริกา ทรงเป็นพระมหากษัตริย์ไทย รัชกาลที่ 9 และทรงครองราชย์ยาวนานที่สุดในไทย (2489-2559) ทรงเป็นที่รักของปวงชนด้วยพระอัจฉริยภาพรอบด้าน ทั้งดนตรี กีฬา ศิลปะ และการพัฒนาโครงการตามหลักปรัชญาเศรษฐกิจพอเพียงเพื่อช่วยเหลือประชาชนตลอด 70 ปีแห่งรัชสมัย",
 image:"Bhumibol.jpg"
},
{
 title:"พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว (รัชกาลที่ 5)",
 detail:"ทรงเป็นกษัตริย์นักปฏิรูป ผู้ทรงพัฒนาสยามให้เจริญทันสมัยสู่สากล ด้วยการเลิกทาส, ปฏิรูประบบการปกครอง, เศรษฐกิจ, กฎหมาย, และการทหาร, รวมถึงการรักษาเอกราชจากชาติตะวันตก, ทรงได้รับการยกย่องเป็น พระปิยมหาราช",
 image:"Chulalongkorn.jpg"
},
{
title:"พ่อขุนรามคำแหงมหาราช",
detail:"กษัตริย์องค์ที่ 3 แห่งราชวงศ์พระร่วง อาณาจักรสุโขทัย (ครองราชย์ประมาณ พ.ศ. 1822-1841) ทรงเป็นผู้ประดิษฐ์อักษรไทย (ลายสือไทย) ใน พ.ศ. 1826 ขยายอาณาเขตสุโขทัยกว้างใหญ่ ปกครองแบบพ่อปกครองลูก และส่งเสริมพระพุทธศาสนาจนรุ่งเรือง ได้รับยกย่องเป็นมหาราชพระองค์แรกของไทย ",
image:"Ramkhamhaeng.jpg"
},
{
 title:"สมเด็จพระนารายณ์มหาราช",
 detail:"เป็นกษัตริย์อยุธยาองค์สำคัญ ที่นำความเจริญสู่กรุงศรีอยุธยาผ่านการทูตกับชาติตะวันตก (ฝรั่งเศส, ฮอลันดา) การค้าขายกับนานาชาติ และรับวิทยาการสมัยใหม่ (ระบบประปา, ดาราศาสตร์) ทำให้กรุงศรีอยุธยาเป็นศูนย์กลางสำคัญทั้งการค้าและวัฒนธรรม ทั้งยังทรงเป็นกวีเอก บำรุงวรรณคดี และสร้างเมืองลพบุรีเป็นราชธานีที่สอง ทรงทำสงครามขยายอาณาเขต",
 image:"Narai.jpg"
},
{
 title:"เซอร์ ไอแซค นิวตัน",
 detail:"เป็นนักฟิสิกส์และคณิตศาสตร์ชาวอังกฤษผู้ยิ่งใหญ่ ผู้สร้างสรรค์ กฎการเคลื่อนที่ 3 ข้อ, กฎแรงโน้มถ่วงสากล, และ การพัฒนาแคลคูลัส ร่วมกับไลบ์นิซ และมีส่วนสำคัญด้าน ทัศนศาสตร์ จากการค้นพบว่าแสงขาวประกอบด้วยทุกสี. ผลงานสำคัญอย่างหนังสือ Principia Mathematica (1687) ได้วางรากฐานกลศาสตร์คลาสสิก และเขายังเป็นบุคคลสำคัญในยุคปฏิวัติวิทยาศาสตร์.",
 image:"Newton.jpg"
},
{
 title:"จูเลียส ซีซาร์ ",
 detail:"เป็นรัฐบุรุษและแม่ทัพโรมันผู้ยิ่งใหญ่ ผู้พิชิตดินแดนกอล (ฝรั่งเศสปัจจุบัน) และข้ามแม่น้ำรุบิโกเพื่อยึดอำนาจ จนกลายเป็นเผด็จการตลอดชีพ ซึ่งนำไปสู่จุดจบของสาธารณรัฐโรมัน เขาถูกลอบสังหารในวัน Ides of March",
 image:"Caesar.jpg"
},
{
 title:"เลโอนาร์โด ดา วินชี",
 detail:"เป็นศิลปินอัจฉริยะและพหูสูตชาวอิตาลีผู้เป็นสัญลักษณ์แห่งยุคเรเนซองส์ มีความสามารถรอบด้านทั้งจิตรกรรม (เช่น โมนาลิซ่า, พระกระยาหารมื้อสุดท้าย), ประติมากรรม, วิศวกรรม, และกายวิภาคศาสตร์ เกิดที่วินชี แคว้นทัสคานี ศึกษาศิลปะในฟลอเรนซ์ มีผลงานโดดเด่นจากการผสมผสานวิทยาศาสตร์เข้ากับศิลปะอย่างละเอียดอ่อน เสียชีวิตในฝรั่งเศสเมื่ออายุ 67 ปี ",
 image:"Vinci.jpg"
},
{
 title:"สมเด็จพระเจ้าตากสินมหาราช",
 detail:"ทรงเป็นวีรกษัตริย์ผู้กอบกู้เอกราชไทยจากการเสียกรุงศรีอยุธยาครั้งที่ 2 ในปี 2310 โดยทรงนำทัพตีพม่าแตก และสถาปนาเมืองธนบุรีเป็นราชธานีใหม่ ทรงรวบรวมแผ่นดินให้เป็นปึกแผ่น ฟื้นฟูบ้านเมือง เศรษฐกิจ และวัฒนธรรม ตลอดระยะเวลาครองราชย์ 15 ปี พระองค์ทรงเป็นชาวไทยเชื้อสายจีน มีพระปรีชาสามารถรอบด้าน ทั้งการทหาร การบริหาร และภาษา",
 image:"Taksin.jpg"
},
{
 title:"สมเด็จพระนเรศวรมหาราช",
 detail:"กษัตริย์องค์ที่ 18 แห่งอยุธยา (ครองราชย์ พ.ศ. 2133-2148) ทรงเป็นวีรกษัตริย์ผู้กอบกู้เอกราชจากการเสียกรุงครั้งที่ 1 ทรงทำสงครามยุทธหัตถีชนะพระมหาอุปราชาในปี พ.ศ. 2135 แผ่อำนาจครอบคลุมดินแดนพม่าตอนใต้และล้านนา ทรงสละพระชนม์ชีพเพื่อป้องป้องแผ่นดินไทยจนสวรรคตระหว่างยกทัพไปเมืองหาง ",
 image:"Naresuan.jpg"
},
{
 title:"นโปเลียน โบนาปาร์ต",
 detail:"คืออัจฉริยะทางทหารและจักรพรรดิแห่งฝรั่งเศส ผู้ก้าวขึ้นสู่อำนาจในช่วงปฏิวัติฝรั่งเศส ขยายอิทธิพลครอบครองยุโรปส่วนใหญ่ด้วยยุทธวิธีที่ชาญฉลาด สถาปนาประมวลกฎหมายนโปเลียน แต่พ่ายแพ้ในศึกรัสเซียและวอเตอร์ลู ก่อนถูกเนรเทศและเสียชีวิตบนเกาะเซนต์เฮเลนา",
 image:"Bonaparte.jpg"
}
];
