const foodData = [
{
 name:"ข้าวผัด",
 country:"ประเทศจีน",
 description:"มีต้นกำเนิดจากประเทศจีน สมัยราชวงศ์สุ่ย (ประมาณ ค.ศ. 589–618) ที่เมืองหยางโจว โดยแนวคิดเริ่มจากการนำข้าวสวยที่เหลือจากมื้อก่อนมาผัดใหม่กับวัตถุดิบต่าง ๆ เพื่อไม่ให้เสียของ ข้าวผัดแพร่หลายไปทั่วโลกพร้อมชาวจีนอพยพ และดัดแปลงสูตรตามท้องถิ่น โดยข้าวผัดหยางโจวถือเป็นรูปแบบคลาสสิกที่ประกอบด้วยกุ้ง แฮม ไข่ และถั่วลันเตา ",
 image:"fried_rice.jpg"
},
{
 name:"ทาโก้",
 country:"เม็กซิกัน",
 description:"ทาโก้ทำจากแผ่นแป้งตอร์ติย่าห่อเนื้อสัตว์ เช่น เนื้อไก่ เนื้อวัว เนื้อหมู และผัก เช่น ผักกาดแก้ว ผักชี มะเขือเทศ หอมแดง โรยชีสและเพิ่มรสชาติด้วยซอส เช่น ซัลซ่า กัวคาโมเล่ ซาวครีม ซึ่งทาโก้นั้นจะมีหลายไส้หลายสูตรต่างกันไป",
 image:"taco.jpg"
}
];
